// Запитуємо вік користувача
let age = prompt("Введіть ваш вік:");

// Перевірка, чи введене значення є числом і не від'ємниме
if (isNaN(age) || age < 0) 
	{
  		console.log("Будь ласка, введіть коректне число, яке не є від'ємним.");
	} else {
  		age = Number(age);

  		// Визначення правильного варіанту слова
  		let suf;
  		if (age % 10 === 1 && age % 100 !== 11) 
		{
    			suf = "рік";
  		} else if (age % 10 >= 2 && age % 10 <= 4 && (age % 100 < 10 || age % 100 >= 20)) 
		{
    			suf = "роки";
  		} else {
    			suf = "років";
  	}

  // Виведення результату
  console.log(`${age} ${suf}`);
}
